[
  {
    "title": "1",
    "order": "1",
    "name": "\"Greatest catch I've ever seen\"",
    "overlay": "right",
    "subhead": "Jan. 10, 2016 | Seahawks 10, Vikings 9",
    "image": "05092019_baldwin-minn_141904.jpg",
    "chatter": "<p>Maybe, as Baldwin said, he wasn’t the most athletic player ever. But you could hardly have known that when in one of the coldest games in NFL history — an NFC wild-card playoff game at Minnesota in 2016 — Baldwin leapt as far as he could to reach with his right hand and bring in a Russell Wilson pass for a 17-yard gain and a first down in the third quarter.</p>\n<p>“Greatest catch I’ve ever seen,’’ Wilson marveled later.</p>\n<p>“It was a beautiful pass by Russell, and he put it in a spot where only I could get the ball,” Baldwin said. “I went up and tried to make a play for it.”</p>\n<p>Baldwin later caught a touchdown pass for the only TD in the game, which Seattle won 10-9.</p>",
    "credit": "Bettina Hansen / The Seattle Times",
    "youtube": "SIrtlP6iu3E",
    "link": "https://www.seattletimes.com/sports/seahawks/even-when-wild-card-loss-to-vikings-seemed-certain-seahawks-remained-optimistic/"
  },
  {
    "title": "2",
    "order": "2",
    "name": "Stealing a win against the Steelers",
    "overlay": "right",
    "subhead": "Nov. 29, 2015 | Seahawks 39, Steelers 30",
    "image": "05092019_2015-Steelers_140142.jpg",
    "chatter": "<p>Baldwin’s greatest season may have come in 2015 when he set a team record with 14 touchdowns, which also tied for the NFL lead that year, 11 coming in a five-game stretch late in the season as Seattle rallied from starts of 0-2 and 2-4 to again make the playoffs.</p>\n<p>The TD streak kicked off on a rainy, gloomy Sunday against the Steelers at CenturyLink Field when Baldwin had three TDs — at the time a career high that he would tie a few weeks later — capped by an 80-yard catch-and-run with 2:01 left that sealed a 39-30 win over Piitsbugh.</p>\n<p>Baldwin reeled in a somewhat low pass from a flu-ridden Wilson on a third-and-10 play, shed the tackle of one defender, then stiff-armed another to break into the open down the sideline. The play was the longest of Baldwin’s career and is memorialized in a large picture on the wall of the team’s training facility in Renton. Seattle hasn’t had a longer play from scrimmage since.\n<p>“Just a crazy catch,’’ coach Pete Carroll said. “He barely got sight of the ball and somehow held on to it.’’</p>",
    "credit": "Dean Rutz / The Seattle Times",
    "youtube": "GKxzGWTNq14",
    "link": "https://www.seattletimes.com/sports/seahawks/doug-baldwins-big-day-lifts-seattle-seahawks-to-offensive-breakout-against-the-pittsburgh-steelers/"
  },
  {
    "title": "3",
    "order": "3",
    "name": "A fitting finale",
    "overlay": "left",
    "subhead": "Dec. 23, 2018 | Seahawks 38, Chiefs 31",
    "image": "05092019_2018-Chiefs_140229.jpg",
    "chatter": "<p>Baldwin battled injuries throughout what would turn out to be his final Seattle season in 2018, held to his fewest catches since 2013 (50).</p>\n<p>But on the night of Dec. 23, he showed that even if age was beginning to take a toll he could still turn in a performance for the ages.</p>\n<p>A 38-31 win over Patrick Mahomes and the Chiefs wasn’t sealed until Baldwin made an amazing juggling catch down the sidelines, outdueling Charvarius Ward to reach out and bobble the ball a few times and then reel it in at the 1-yard line, setting up a Chris Carson TD run. It was barely better than the twisting-and-turning touchdown catch he had made the previous quarter on a night when he had seven receptions for 126 yards.</p>\n<p>“I’ve never seen Doug play better than that,’’ Carroll said later.</p>",
    "credit": "Bettina Hansen / The Seattle Times",
    "youtube": "C2fDDEIuSUk",
    "link": "https://www.seattletimes.com/sports/seahawks/seahawks-outduel-kansas-city-chiefs-to-fight-their-way-back-to-the-playoffs/"
  },
  {
    "title": "4",
    "order": "4",
    "name": "A title-game spark with a reception and a return",
    "overlay": "left",
    "subhead": "Jan. 19, 2014 | Seahawks 23, 49ers 17",
    "image": "05092019_2014-NFC_140253.jpg",
    "chatter": "<p>It may be easy to forget now that among the things that first helped Baldwin make the team in 2011 as an undrafted free agent out of Stanford was his play on special teams.</p>\n<p>And in a win that was as big as any in franchise history — the 2014 NFC title game victory over the 49ers that got Seattle to the Super Bowl — Baldwin returned to those special teams roots to give the Seahawks a much-needed boost on a day when every point and yard mattered.</p>\nWith Percy Harvin out, having been injured the week before — and Seattle wanting a trusted pair of hands to handle the returns in a game with stakes as big as any — Baldwin got the call as the kickoff returner despite having returned just two kicks all season.</p>\n<p>Baldwin returned three that day for 109 yards, an average of 36.33 that is third-best in any playoff game in team history, including a 69-yarder in the third quarter that came at a particularly critical time, after the 49ers had scored to take a 17-10. The return led to a field goal that helped spark a 13-0 run for Seattle the rest of the way.</p>\n<p>Baldwin also topped the century mark that day in receiving with six catches for 106 yards, including a 51-yarder in the second quarter that was also critical.</p><p>Seattle’s first three possessions that day were a fumble, a punt and a punt before Wilson scrambled and hit Baldwin downfield for 51 yards — the kind of play the two trademarked in their time together — that led to a field goal and got Seattle finally on the board.</p>",
    "credit": "John Lok / The Seattle Times",
    "youtube": "3G2_ruG44M4",
    "link": "http://old.seattletimes.com/html/seahawks/2022711241_seahawks20xml.html"
  },
  {
    "title": "5",
    "order": "5",
    "name": "Super Bowl scores",
    "overlay": "right",
    "subhead": "Feb. 2, 2014 | Seahawks 43, Broncos 8",
    "image": "05092019_2014-Super-Bowl_140154.jpg",
    "chatter": "<p>Baldwin scored touchdowns in each of the two Super Bowls in which he played for Seattle.</p>\n<p>His first didn’t really matter in the outcome — a 10-yard pass from Wilson with 11:45 left. But it was memorable all the same, as Baldwin’s dive under a few Denver defenders into the end zone gave Seattle its final points in a 43-8 win and made about as loud of a statement as possible that the Seahawks receivers were far more than “pedestrian,’’ — the label that had been given them in a story in USA Today the week prior to the game. And that it was an undrafted free agent scoring the final touchdown in Seattle’s first — and so far only — Super Bowl win just seemed to make sense.</p>",
    "credit": "John Lok / The Seattle Times",
    "youtube": "N-byJvHAXQA",
    "link": "http://old.seattletimes.com/flatpages/sports/seahawks/superbowlxlviii/"
  }
]